Revit 2026 API

# FieldValueType Property

---

The type of the values stored in the field.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Type ValueType { get; }
```
```vb
Public ReadOnly Property ValueType As Type
	Get
```
```cpp
public:
property Type^ ValueType {
	Type^ get ();
}
```
```fsharp
member ValueType : Type with get
```

#### Property Value

Type

For key-value maps, this is the value type.

#### Reference

Field Class

Autodesk.Revit.DB.ExtensibleStorage Namespace